# способы достать что то из словарей
# 1. keys, value, items методы
# 2. по ключу d["молоко"] # Key ERROR
# 3. метод get d.get(название ключа) None
# 4. d.pop

# d = {
#     []
# }
# d[].append(3)
# print(d)

# d2[k] = len(v)
# запиши мне в новом словаре значение ключ как укажу Я


"============================================================================="
# a = a -1
# ==
# a -= 1
# тоже самое

"=============================================================================="
# continue возобновляет цикл с самого начало чаще используют с if
# break тормоз, полностью его останваливает, ломает цикл буквально

# for i in range(10)
# print(i)
# if i > 5:
#     break

# # 0, 1, 2, 3, 4, 5


# a = 1
# b = 2
# c = 3
# a, b, c = b, c, a
# print(a, b, c)


# неизменяемый тип даннных вы мотете толко смотреть ка но доску но только перезаписывать сами вы не можете менять данные на доске

c = [letter for letter in 'human']
print(c)
